app/Controllers/Empresas.php


        else:

            $data['empresas'] = $this->empresa_model
                                            ->findAll();
---
SELECT *
FROM `empresas`

    public function show($id_empresa)
    {
        if($this->session->get('tipo') != $this->tipo) :
            $this->session->setFlashdata(
                'alert',
                [
                    'type' => 'error',
                    'title' => 'Acesso negado, você não tem permissão para fazer esse acesso!'
                ]
            );
            return redirect()->to('/login');
        endif;
        // -------------------------------------------------------------------- //

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Dados da Empresa',
            'icone'  => 'fa fa-database'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Nova Empresa", 'rota'   => "", 'active' => true]
        ];

        $data['empresa'] = $this->empresa_model
                                ->where('empresas.id_empresa', $id_empresa)
                                ->join('ufs', 'empresas.id_uf = ufs.id_uf')
                                ->join('municipios', 'empresas.id_municipio = municipios.id_municipio')
                                ->join('login', 'empresas.id_empresa = login.id_empresa')
                                ->first();
---
SELECT *
FROM `empresas`
JOIN `ufs` ON `empresas`.`id_uf` = `ufs`.`id_uf`
JOIN `municipios` ON `empresas`.`id_municipio` = `municipios`.`id_municipio`
JOIN `login` ON `empresas`.`id_empresa` = `login`.`id_empresa`
WHERE `empresas`.`id_empresa` = '2'
 LIMIT 1