app/Controllers/Inicio.php

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '2'
AND `id_login` = '3'
 LIMIT 1
SELECT *
FROM `clientes`
WHERE `id_empresa` = '2'
SELECT *
FROM `produtos`
WHERE `id_empresa` = '2'
SELECT *
FROM `vendas`
WHERE `id_empresa` = '2'
AND `data` >= '2024-02-01'
AND `data` <= '2024-02-29'
SELECT *
FROM `lancamentos`
WHERE `id_empresa` = '2'
---
    public function index()
    {
        // Revifica se tem uma sessão ativa
        if($this->session->get('tipo') == null):
            $this->session->setFlashdata(
                'alert',
                [
                    'type' => 'error',
                    'title' => 'Você não está logado! Acesse sua conta para continuar.'
                ]
            );

            return redirect()->to('/login');
        endif;

        $data['link'] = [
            'item' => '1'
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                                    ->where('id_empresa', $this->id_empresa)
                                                    ->where('id_login', $this->id_login)
                                                    ->first();

        $clientes = $this->cliente_model
                                    ->where('id_empresa', $this->id_empresa)
                                    ->findAll();

        $produtos = $this->produto_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

        $vendas = $this->venda_model
                            ->where('id_empresa', $this->id_empresa)
                            ->where('data >=', date("Y-m-01"))
                            ->where('data <=', date("Y-m-t"))
                            ->findAll();

        $lancamentos = $this->lancamento_model
                                    ->where('id_empresa', $this->id_empresa)
                                    ->findAll();

SELECT *
FROM `orcamentos`
WHERE `id_empresa` = '2'
---
            $faturamento += $venda['valor_a_pagar'];
        }

        $orcamentos = $this->orcamento_model
                                    ->where('id_empresa', $this->id_empresa)
                                    ->findAll();

SELECT SUM(`valor_a_pagar`) AS `valor_a_pagar`
FROM `vendas`
WHERE `id_empresa` = '2'
AND `data` = '2024-02-1'
 LIMIT 1
---

        for ($i = 1; $i <= 31; $i++)
        {
            $valor = $this->venda_model
                            ->where('id_empresa', $this->id_empresa)
                            ->where('data', date("Y-m-$i"))
                            ->selectSum('valor_a_pagar')
                            ->first()['valor_a_pagar'];

SELECT SUM(`valor_a_pagar`) AS `valor_a_pagar`
FROM `vendas`
WHERE `id_empresa` = '2'
AND `data` >= '2024-1-01'
AND `data` <= '2024-1-29'
 LIMIT 1
---
        $faturamento_por_meses = [];
        for($i = 1; $i <= 12; $i++)
        {
            $valor = $this->venda_model
                            ->where('id_empresa', $this->id_empresa)
                            ->where('data >=', date("Y-$i-01"))
                            ->where('data <=', date("Y-$i-t"))
                            ->selectSum('valor_a_pagar')
                            ->first();

SELECT *
FROM `contas_a_pagar`
WHERE `id_empresa` = '2'
AND `data_de_vencimento` >= '2024-02-01'
AND `data_de_vencimento` <= '2024-02-29'
SELECT *
FROM `contas_a_receber`
WHERE `id_empresa` = '2'
AND `data_de_vencimento` >= '2024-02-01'
AND `data_de_vencimento` <= '2024-02-29'
---
        }

        // ------------------------ CONTAS A PAGAR E RECEBER DO MES ATUAL ------------------------- //
        $contas_pagar = $this->conta_pagar_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('data_de_vencimento >=', date('Y-m-01'))
                                            ->where('data_de_vencimento <=', date('Y-m-t'))
                                            ->findAll();

        $contas_receber = $this->conta_receber_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('data_de_vencimento >=', date('Y-m-01'))
                                            ->where('data_de_vencimento <=', date('Y-m-t'))
                                            ->findAll();