app/Controllers/Login.php


            elseif($login['tipo'] == 2) :

                $empresa = $this->empresa_model
                                ->where('id_empresa', $login['id_empresa'])
                                ->select('xFant, logomarca')
                                ->first();
---
SELECT `xFant`, `logomarca`
FROM `empresas`
WHERE `id_empresa` = '2'
 LIMIT 1