app/Controllers/Vendas.php

    public function index()
    {
        // Verifica se tem permissão de acesso
        if ($url = $this->permissao):
            return redirect()->to($url);
        endif;

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Vendas',
            'icone'  => 'fa fa-database'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Vendas", 'rota'   => "", 'active' => true]
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $vendas = $this->venda_model
                        ->where('vendas.id_empresa', $this->id_empresa)
                        ->join('clientes', 'vendas.id_cliente = clientes.id_cliente')
                        ->find();
---
SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '2'
AND `id_login` = '3'
 LIMIT 1
SELECT *
FROM `vendas`
JOIN `clientes` ON `vendas`.`id_cliente` = `clientes`.`id_cliente`
WHERE `vendas`.`id_empresa` = '2'

    public function show($id_venda)
    {
        // Verifica se tem permissão de acesso
        if ($url = $this->permissao):
            return redirect()->to($url);
        endif;

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Dados da Venda',
            'icone'  => 'fa fa-database'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Dados", 'rota'   => "", 'active' => true]
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['empresa'] = $this->empresa_model
                                ->where('id_empresa', $this->id_empresa)
                                ->join('ufs', 'empresas.id_uf = ufs.id_uf')
                                ->join('municipios', 'empresas.id_municipio = municipios.id_municipio')
                                ->first();

        $data['venda'] = $this->venda_model
                                ->where('id_empresa', $this->id_empresa)
                                ->where('id_venda', $id_venda)
                                ->first();

        // Adiciona um elemento 'nome_do_cliente' e 'nome_do_vendedor' ao array associativo vendas
        $data['venda']['nome_do_cliente'] = $this->cliente_model
                                                ->where('id_empresa', $this->id_empresa)
                                                ->where('id_cliente', $data['venda']['id_cliente'])
                                                ->first()['nome'];
---
SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '2'
AND `id_login` = '3'
 LIMIT 1
SELECT *
FROM `empresas`
JOIN `ufs` ON `empresas`.`id_uf` = `ufs`.`id_uf`
JOIN `municipios` ON `empresas`.`id_municipio` = `municipios`.`id_municipio`
WHERE `id_empresa` = '2'
 LIMIT 1
SELECT *
FROM `vendas`
WHERE `id_empresa` = '2'
AND `id_venda` = '3'
 LIMIT 1
SELECT *
FROM `clientes`
WHERE `id_empresa` = '2'
AND `id_cliente` = '2'
 LIMIT 1

                                                ->where('id_vendedor', $data['venda']['id_vendedor'])
                                                ->first()['nome'];

        $data['produtos_da_venda'] = $this->produtos_da_venda
                                        ->where('id_empresa', $this->id_empresa)
                                        ->where('id_venda', $id_venda)
                                        ->findAll();

        $data['transportadoras'] = $this->transportadora_model
                                        ->where('id_empresa', $this->id_empresa)
                                        ->findAll();

        $data['unidades'] = $this->unidade_model
                                        ->findAll();
---
SELECT *
FROM `produtos_da_venda`
WHERE `id_empresa` = '2'
AND `id_venda` = '3'
SELECT *
FROM `transportadoras`
WHERE `id_empresa` = '2'
SELECT *
FROM `unidades`