app/Models/ControleDeAcessoModel.php

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '2'
AND `id_login` = '3'
 LIMIT 1
---
    public function verificaPermissao($funcionalidade)
    {
        $session = session();

        // Verifica se existe sessão
        if($session->get('tipo') != null):

            $controle_de_acesso = $this
                                    ->where('id_empresa', $session->get('id_empresa'))
                                    ->where('id_login', $session->get('id_login'))
                                    ->first();